HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_reg.h
/** \brief 21C, Serial Data and Status Register 33 */
#define PSI5_CH3_SDS3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF000521Cu)
/** Alias (User Manual Name) for PSI5_CH3_SDS3.
* To use register names with standard convension, please use PSI5_CH3_SDS3.
*/
#define PSI5_SDS33 (PSI5_CH3_SDS3)

/** \brief 220, Serial Data and Status Register 34 */
#define PSI5_CH3_SDS4 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005220u)
/** Alias (User Manual Name) for PSI5_CH3_SDS4.
* To use register names with standard convension, please use PSI5_CH3_SDS4.
*/
#define PSI5_SDS34 (PSI5_CH3_SDS4)

/** \brief 224, Serial Data and Status Register 35 */
#define PSI5_CH3_SDS5 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDS*)0xF0005224u)
/** Alias (User Manual Name) for PSI5_CH3_SDS5.
* To use register names with standard convension, please use PSI5_CH3_SDS5.
*/
#define PSI5_SDS35 (PSI5_CH3_SDS5)

/** \brief 228, Start of Pulse Time Stamp Capture Register 3 */
#define PSI5_CH3_SPTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SPTSC*)0xF0005228u)
/** Alias (User Manual Name) for PSI5_CH3_SPTSC.
* To use register names with standard convension, please use PSI5_CH3_SPTSC.
*/
#define PSI5_SPTSC3 (PSI5_CH3_SPTSC)

/** \brief 22C, Start of Frame Time Stamp Capture Register 3 */
#define PSI5_CH3_SFTSC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SFTSC*)0xF000522Cu)
/** Alias (User Manual Name) for PSI5_CH3_SFTSC.
* To use register names with standard convension, please use PSI5_CH3_SFTSC.
*/
#define PSI5_SFTSC3 (PSI5_CH3_SFTSC)

/** \brief 230, Receive Data Register Low 3 */
#define PSI5_CH3_RDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRL*)0xF0005230u)
/** Alias (User Manual Name) for PSI5_CH3_RDRL.
* To use register names with standard convension, please use PSI5_CH3_RDRL.
*/
#define PSI5_RDRL3 (PSI5_CH3_RDRL)

/** \brief 234, Receive Data Register High 3 */
#define PSI5_CH3_RDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_RDRH*)0xF0005234u)
/** Alias (User Manual Name) for PSI5_CH3_RDRH.
* To use register names with standard convension, please use PSI5_CH3_RDRH.
*/
#define PSI5_RDRH3 (PSI5_CH3_RDRH)

/** \brief 238, Pulse Generation Control Register 3 */
#define PSI5_CH3_PGC /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_PGC*)0xF0005238u)
/** Alias (User Manual Name) for PSI5_CH3_PGC.
* To use register names with standard convension, please use PSI5_CH3_PGC.
*/
#define PSI5_PGC3 (PSI5_CH3_PGC)

/** \brief 23C, Channel Trigger Value Register 3 */
#define PSI5_CH3_CTV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_CTV*)0xF000523Cu)
/** Alias (User Manual Name) for PSI5_CH3_CTV.
* To use register names with standard convension, please use PSI5_CH3_CTV.
*/
#define PSI5_CTV3 (PSI5_CH3_CTV)

/** \brief 240, Send Control Register 3 */
#define PSI5_CH3_SCR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SCR*)0xF0005240u)
/** Alias (User Manual Name) for PSI5_CH3_SCR.
* To use register names with standard convension, please use PSI5_CH3_SCR.
*/
#define PSI5_SCR3 (PSI5_CH3_SCR)

/** \brief 244, Send Data Register Low 3 */
#define PSI5_CH3_SDRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRL*)0xF0005244u)
/** Alias (User Manual Name) for PSI5_CH3_SDRL.
* To use register names with standard convension, please use PSI5_CH3_SDRL.
*/
#define PSI5_SDRL3 (PSI5_CH3_SDRL)

/** \brief 248, Send Data Register High 3 */
#define PSI5_CH3_SDRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SDRH*)0xF0005248u)
/** Alias (User Manual Name) for PSI5_CH3_SDRH.
* To use register names with standard convension, please use PSI5_CH3_SDRH.
*/
#define PSI5_SDRH3 (PSI5_CH3_SDRH)

/** \brief 24C, Send Shift Register Low 3 */
#define PSI5_CH3_SSRL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRL*)0xF000524Cu)
/** Alias (User Manual Name) for PSI5_CH3_SSRL.
* To use register names with standard convension, please use PSI5_CH3_SSRL.
*/
#define PSI5_SSRL3 (PSI5_CH3_SSRL)

/** \brief 250, Send Shift Register High 3 */
#define PSI5_CH3_SSRH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SSRH*)0xF0005250u)
/** Alias (User Manual Name) for PSI5_CH3_SSRH.
* To use register names with standard convension, please use PSI5_CH3_SSRH.
*/
#define PSI5_SSRH3 (PSI5_CH3_SSRH)

/** \brief 254, Send Output Register Low 3 */
#define PSI5_CH3_SORL /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORL*)0xF0005254u)
/** Alias (User Manual Name) for PSI5_CH3_SORL.
* To use register names with standard convension, please use PSI5_CH3_SORL.
*/
#define PSI5_SORL3 (PSI5_CH3_SORL)

/** \brief 258, Send Output Register High 3 */
#define PSI5_CH3_SORH /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CH_SORH*)0xF0005258u)
/** Alias (User Manual Name) for PSI5_CH3_SORH.
* To use register names with standard convension, please use PSI5_CH3_SORH.
*/
#define PSI5_SORH3 (PSI5_CH3_SORH)

/** \brief 2F8, Interrupt Overview Register */
#define PSI5_INTOV /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTOV*)0xF00052F8u)

/** \brief 2FC, Interrupt Node Pointer Register 0 */
#define PSI5_INP0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF00052FCu)

/** \brief 300, Interrupt Node Pointer Register 1 */
#define PSI5_INP1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF0005300u)

/** \brief 304, Interrupt Node Pointer Register 2 */
#define PSI5_INP2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF0005304u)

/** \brief 308, Interrupt Node Pointer Register 3 */
#define PSI5_INP3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INP*)0xF0005308u)

/** \brief 310, Interrupt Status Register A 0 */
#define PSI5_INTSTATA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005310u)

/** \brief 314, Interrupt Status Register A 1 */
#define PSI5_INTSTATA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005314u)

/** \brief 318, Interrupt Status Register A 2 */
#define PSI5_INTSTATA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF0005318u)

/** \brief 31C, Interrupt Status Register A 3 */
#define PSI5_INTSTATA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATA*)0xF000531Cu)

/** \brief 324, Interrupt Status Register B 0 */
#define PSI5_INTSTATB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005324u)

