HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_reg.h
/** \brief 328, Interrupt Status Register B 1 */
#define PSI5_INTSTATB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005328u)

/** \brief 32C, Interrupt Status Register B 2 */
#define PSI5_INTSTATB2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF000532Cu)

/** \brief 330, Interrupt Status Register B 3 */
#define PSI5_INTSTATB3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSTATB*)0xF0005330u)

/** \brief 338, Interrupt Set Register A 0 */
#define PSI5_INTSETA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005338u)

/** \brief 33C, Interrupt Set Register A 1 */
#define PSI5_INTSETA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF000533Cu)

/** \brief 340, Interrupt Set Register A 2 */
#define PSI5_INTSETA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005340u)

/** \brief 344, Interrupt Set Register A 3 */
#define PSI5_INTSETA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETA*)0xF0005344u)

/** \brief 34C, Interrupt Set Register B 0 */
#define PSI5_INTSETB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF000534Cu)

/** \brief 350, Interrupt Set Register B 1 */
#define PSI5_INTSETB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005350u)

/** \brief 354, Interrupt Set Register B 2 */
#define PSI5_INTSETB2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005354u)

/** \brief 358, Interrupt Set Register B 3 */
#define PSI5_INTSETB3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTSETB*)0xF0005358u)

/** \brief 360, Interrupt Clear Register A 0 */
#define PSI5_INTCLRA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005360u)

/** \brief 364, Interrupt Clear Register A 1 */
#define PSI5_INTCLRA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005364u)

/** \brief 368, Interrupt Clear Register A 2 */
#define PSI5_INTCLRA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF0005368u)

/** \brief 36C, Interrupt Clear Register A 3 */
#define PSI5_INTCLRA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRA*)0xF000536Cu)

/** \brief 374, Interrupt Clear Register A 0 */
#define PSI5_INTCLRB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005374u)

/** \brief 378, Interrupt Clear Register A 1 */
#define PSI5_INTCLRB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005378u)

/** \brief 37C, Interrupt Clear Register A 2 */
#define PSI5_INTCLRB2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF000537Cu)

/** \brief 380, Interrupt Clear Register A 3 */
#define PSI5_INTCLRB3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTCLRB*)0xF0005380u)

/** \brief 388, Interrupt Enable Register A 0 */
#define PSI5_INTENA0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005388u)

/** \brief 38C, Interrupt Enable Register A 1 */
#define PSI5_INTENA1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF000538Cu)

/** \brief 390, Interrupt Enable Register A 2 */
#define PSI5_INTENA2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005390u)

/** \brief 394, Interrupt Enable Register A 3 */
#define PSI5_INTENA3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENA*)0xF0005394u)

/** \brief 39C, Interrupt Enable Register B 0 */
#define PSI5_INTENB0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF000539Cu)

/** \brief 3A0, Interrupt Enable Register B 1 */
#define PSI5_INTENB1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A0u)

/** \brief 3A4, Interrupt Enable Register B 2 */
#define PSI5_INTENB2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A4u)

/** \brief 3A8, Interrupt Enable Register B 3 */
#define PSI5_INTENB3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_INTENB*)0xF00053A8u)

/** \brief 3CC, OCDS Control and Status */
#define PSI5_OCS /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_OCS*)0xF00053CCu)

/** \brief 3D0, Access Enable Register 0 */
#define PSI5_ACCEN0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_ACCEN0*)0xF00053D0u)

/** \brief 3D4, Access Enable Register 1 */
#define PSI5_ACCEN1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_ACCEN1*)0xF00053D4u)

/** \brief 3D8, Kernel Reset Register 0 */
#define PSI5_KRST0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRST0*)0xF00053D8u)

/** \brief 3DC, Kernel Reset Register 1 */
#define PSI5_KRST1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRST1*)0xF00053DCu)

/** \brief 3E0, Kernel Reset Status Clear Register */
#define PSI5_KRSTCLR /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_KRSTCLR*)0xF00053E0u)

/** \brief 3E4, Receive FIFO Control Register 0 */
#define PSI5_RFC0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E4u)

/** \brief 3E8, Receive FIFO Control Register 1 */
#define PSI5_RFC1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053E8u)

/** \brief 3EC, Receive FIFO Control Register 2 */
#define PSI5_RFC2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053ECu)

/** \brief 3F0, Receive FIFO Control Register 3 */
#define PSI5_RFC3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RFC*)0xF00053F0u)

/** \brief 3F8, Receive Data FIFO 0 */
#define PSI5_RDF0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053F8u)

/** \brief 3FC, Receive Data FIFO 1 */
#define PSI5_RDF1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF00053FCu)

/** \brief 400, Receive Data FIFO 2 */
#define PSI5_RDF2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF0005400u)

/** \brief 404, Receive Data FIFO 3 */
#define PSI5_RDF3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDF*)0xF0005404u)

/** \brief 40C, RSI Overview Register 0 */
#define PSI5_RSIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF000540Cu)

/** \brief 410, RSI Overview Register 1 */
#define PSI5_RSIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005410u)

/** \brief 414, RSI Overview Register 2 */
#define PSI5_RSIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005414u)

/** \brief 418, RSI Overview Register 3 */
#define PSI5_RSIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSIOV*)0xF0005418u)

/** \brief 420, RMI Overview Register 0 */
#define PSI5_RMIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005420u)

/** \brief 424, RMI Overview Register 1 */
#define PSI5_RMIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005424u)

