HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxPsi5_reg.h
/** \brief 428, RMI Overview Register 2 */
#define PSI5_RMIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF0005428u)

/** \brief 42C, RMI Overview Register 3 */
#define PSI5_RMIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMIOV*)0xF000542Cu)

/** \brief 434, NBI Overview Register 0 */
#define PSI5_NBIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005434u)

/** \brief 438, NBI Overview Register 1 */
#define PSI5_NBIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005438u)

/** \brief 43C, NBI Overview Register 2 */
#define PSI5_NBIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF000543Cu)

/** \brief 440, NBI Overview Register 3 */
#define PSI5_NBIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBIOV*)0xF0005440u)

/** \brief 448, TEI Overview Register 0 */
#define PSI5_TEIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005448u)

/** \brief 44C, TEI Overview Register 1 */
#define PSI5_TEIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF000544Cu)

/** \brief 450, TEI Overview Register 2 */
#define PSI5_TEIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005450u)

/** \brief 454, TEI Overview Register 3 */
#define PSI5_TEIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEIOV*)0xF0005454u)

/** \brief 45C, CRCI Overview Register 0 */
#define PSI5_CRCIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF000545Cu)

/** \brief 460, CRCI Overview Register 1 */
#define PSI5_CRCIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005460u)

/** \brief 464, CRCI Overview Register 2 */
#define PSI5_CRCIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005464u)

/** \brief 468, CRCI Overview Register 3 */
#define PSI5_CRCIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCIOV*)0xF0005468u)

/** \brief 470, RDI Overview Register 0 */
#define PSI5_RDIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF0005470u)

/** \brief 474, RDI Overview Register 1 */
#define PSI5_RDIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF0005474u)

/** \brief 478, RDI Overview Register 2 */
#define PSI5_RDIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF0005478u)

/** \brief 47C, RDI Overview Register 3 */
#define PSI5_RDIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDIOV*)0xF000547Cu)

/** \brief 484, NFI Overview Register 0 */
#define PSI5_NFIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005484u)

/** \brief 488, NFI Overview Register 1 */
#define PSI5_NFIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005488u)

/** \brief 48C, NFI Overview Register 2 */
#define PSI5_NFIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF000548Cu)

/** \brief 490, NFI Overview Register 3 */
#define PSI5_NFIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NFIOV*)0xF0005490u)

/** \brief 498, MEI Overview Register 0 */
#define PSI5_MEIOV0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF0005498u)

/** \brief 49C, MEI Overview Register 1 */
#define PSI5_MEIOV1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF000549Cu)

/** \brief 4A0, MEI Overview Register 2 */
#define PSI5_MEIOV2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A0u)

/** \brief 4A4, MEI Overview Register 3 */
#define PSI5_MEIOV3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_MEIOV*)0xF00054A4u)

/** \brief 4AC, RSI Overview Set Register 0 */
#define PSI5_RSISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054ACu)

/** \brief 4B0, RSI Overview Set Register 1 */
#define PSI5_RSISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B0u)

/** \brief 4B4, RSI Overview Set Register 2 */
#define PSI5_RSISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B4u)

/** \brief 4B8, RSI Overview Set Register 3 */
#define PSI5_RSISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RSISET*)0xF00054B8u)

/** \brief 4C0, RMI Overview Set Register 0 */
#define PSI5_RMISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C0u)

/** \brief 4C4, RMI Overview Set Register 1 */
#define PSI5_RMISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C4u)

/** \brief 4C8, RMI Overview Set Register 2 */
#define PSI5_RMISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054C8u)

/** \brief 4CC, RMI Overview Set Register 3 */
#define PSI5_RMISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RMISET*)0xF00054CCu)

/** \brief 4D4, NBI Overview Set Register 0 */
#define PSI5_NBISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D4u)

/** \brief 4D8, NBI Overview Set Register 1 */
#define PSI5_NBISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054D8u)

/** \brief 4DC, NBI Overview Set Register 2 */
#define PSI5_NBISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054DCu)

/** \brief 4E0, NBI Overview Set Register 3 */
#define PSI5_NBISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_NBISET*)0xF00054E0u)

/** \brief 4E8, TEI Overview Set Register 0 */
#define PSI5_TEISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054E8u)

/** \brief 4EC, TEI Overview Set Register 1 */
#define PSI5_TEISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054ECu)

/** \brief 4F0, TEI Overview Set Register 2 */
#define PSI5_TEISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F0u)

/** \brief 4F4, TEI Overview Set Register 3 */
#define PSI5_TEISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_TEISET*)0xF00054F4u)

/** \brief 4FC, CRCI Overview Set Register 0 */
#define PSI5_CRCISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF00054FCu)

/** \brief 500, CRCI Overview Set Register 1 */
#define PSI5_CRCISET1 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005500u)

/** \brief 504, CRCI Overview Set Register 2 */
#define PSI5_CRCISET2 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005504u)

/** \brief 508, CRCI Overview Set Register 3 */
#define PSI5_CRCISET3 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_CRCISET*)0xF0005508u)

/** \brief 510, RDI Overview Set Register 0 */
#define PSI5_RDISET0 /*lint --e(923, 9078)*/ (*(volatile Ifx_PSI5_RDISET*)0xF0005510u)

